#+TITLE: Understanding and Predicting Property Maintenance Fines with Dask

* Grid Search
  Anything above 4 cores seems to freeze my desktop (which has 8).

#+BEGIN_SRC ipython :session blight :results output
sqrt_features = int(len(x_train.columns)**0.5)
print(sqrt_features)
#+END_SRC

#+RESULTS:
: 21

#+BEGIN_SRC ipython :session blight :results none
forest_base = RandomForestClassifier()
cores = 4
param_grid = dict(n_estimators=range(15, 25),
                  max_features=range(sqrt_features-2, sqrt_features+2, 2),)
forest = GridSearchCV(forest_base, param_grid, scoring="roc_auc", n_jobs=cores,
                      cv=10)
dask_forest = DaskGridSearch(forest_base, param_grid, scoring="roc_auc", cv=10)
#+END_SRC

#+BEGIN_SRC ipython :session blight :results output
print("Candidates in grid: {0}".format(len(ParameterGrid(param_grid))))
#+END_SRC

#+RESULTS:
: Candidates in grid: 4

#+BEGIN_SRC ipython :session blight :results output
start = datetime.now()
forest.fit(x_train, y_train)
print(str(datetime.now() - start))
#+END_SRC

#+RESULTS:
: 0:02:32.974432

That wasn't too bad, although I'm using a narrow band of features. How did it do?

#+BEGIN_SRC ipython :session blight :results output
print(forest.best_score_)
print(forest.best_params_)
#+END_SRC

#+RESULTS:
: 0.778873189594
: {'max_features': 21, 'n_estimators': 15}

So, it's sayng that the max-features topped out at 21, which is more than the model I submitted (and which is the recommended square-root of the features) but why would the fewest estimators be the best?

#+BEGIN_SRC ipython :session blight :results output
start = datetime.now()
dask_forest.fit(x_train, y_train)
print(str(datetime.now() - start ))
#+END_SRC

#+RESULTS:
: 0:03:45.981466

Surprisingly this took longer. Here's what I saw on top. The n_jobs feature for the sklearn =GridSearchCV= uses as many processes as you give it (so n_jobs=4 ends up with 4 processes spawned in top) while dask uses threads in a single processor, so there was one process in top but it was running at ~750%. Since it was using all the available threads you would think it would be faster, but it wasn't. So threads are slower than forked processes?

#+BEGIN_SRC ipython :session blight :results output
print(dask_forest.best_score_)
print(dask_forest.best_params_)
#+END_SRC

#+RESULTS:
: 0.77891073203
: {'max_features': 21, 'n_estimators': 15}

At least the answer was the same (which you'd expect since this was an exhaustive search).

